public/man/man1/xdg-terminal.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - xdg-terminal.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - xdg-terminal.1</h1>
    
<p>.SH &#34;NAME&#34; xdg-terminal - opens the users preferred terminal emulator
application</p>
<p>
.SH &#34;SYNOPSIS&#34;</p>
<p>
.HP u</p>
<p>
<strong>xdg-terminal</strong> [/command/]</p>
<p>
.HP u</p>
<p>
<strong>xdg-terminal</strong> { | <strong>–help</strong> | <strong>–manual</strong> | <strong>–version</strong> }</p>
<p>
.SH &#34;DESCRIPTION&#34;</p>
<p>
.PP xdg-terminal opens the users preferred terminal emulator
application. If a command is provided the command will be executed by
the shell within the newly opened terminal window.</p>
<p>
.PP xdg-terminal is for use inside a desktop session only. It is not
recommended to use xdg-terminal as root.</p>
<p>
.SH &#34;OPTIONS&#34;</p>
<p>
.PP <strong>–help</strong></p>
<blockquote>
<p>Show command synopsis.</p>
<p>
.RE</p>
<p>
.PP <strong>–manual</strong></p>
<blockquote>
<p>Show this manual page.</p>
<p>
.RE</p>
<p>
.PP <strong>–version</strong></p>
<blockquote>
<p>Show the xdg-utils version information.</p>
<p>
.RE .SH &#34;EXIT CODES&#34;</p>
<p>
.PP An exit code of 0 indicates success while a non-zero exit code
indicates failure. The following failure codes can be returned:</p>
<p>
.PP <strong>1</strong></p>
<blockquote>
<p>Error in command line syntax.</p>
<p>
.RE .PP <strong>3</strong></p>
<blockquote>
<p>A required tool could not be found.</p>
<p>
.RE .PP <strong>4</strong></p>
<blockquote>
<p>The action failed.</p>
<p>
.RE .SH &#34;EXAMPLES&#34;</p>
<p>
.PP</p>
<blockquote>
<pre class="example">
xdg-terminal
</pre>
</blockquote>
<p>
Opens the users default terminal emulator, just starting an interactive
shell.</p>
<p>
.PP</p>
<blockquote>
<pre class="example">
xdg-terminal top
</pre>
</blockquote>
<p>
Opens the users default terminal emulator and lets it run the top
executable.</p>
</blockquote>
</blockquote>
</blockquote>
</blockquote>
</blockquote>
</blockquote>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
AUTHOR
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p><strong>Kevin Krammer</strong></p>
<blockquote>
<p>Author.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
COPYRIGHT
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>\\
Copyright © 2006\\</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
